{"/docs/create-ssl-for-viettel-cloud":{"title":"Create SSL for Viettel Cloud","data":{"":"Create new account at ZeroSSL . With new account will be Free 3 months\nIn Dashboard, click New Certificate (Image 1)\nEnter required information (Domains: 27.71.232.40; Validity: 90-Day Certificate; Finalize Your Order: Free) => click Next Step\nVerification Method for 27.71.232.40 choose HTTP File Upload and Download Auth File. After download complete, click Next Step  (Image 2)\n5.Add file downloaded to Viettel cloud IIS  with URL in Image 2\n6. Click Verify Domain (Image 3)\nDownload Certificate as zip file (Image 4) and click Next Step\nExtract zip file on Viettel Server, open Start Menu, type openssl, open program and browse to extracted folder (Image 5)\nCopy content file create file pfx.txt and run in Open SSL cmd (Image 6)\nEnter password, this password use to import certificate into IIS (ex: robinsonpharma), after done, we have certificate.pfx file in extracted folder (Image 7)\nOpen IIS Manager → Server Certificates → Remove old certificate (if any) → Click Import (Image 8)\nUse pfx file create before and password enter at step 10 → click OK (Image 9)\nIn IIS choose each Website and update binding to new certificate (Image 10)"}},"/docs/install-ssh-server-on-window":{"title":"How to Install SSH Server on Windows","data":{"":"To set up SSH access to your Windows server, you can use the built-in OpenSSH Server. Here's a step-by-step guide:\nInstall OpenSSH Server: Open PowerShell as Administrator and run the following command:\nAdd-WindowsCapability -Online -Name OpenSSH.Server~~~~0.0.1.0\nStart the service: Once installed, start the SSH server service by running:\nStart-Service sshd\nSet the service to start automatically: To ensure the SSH server is automatically started after a reboot, run:\nSet-Service -Name sshd -StartupType 'Automatic'\nConfirm the Firewall rule is configured: It should be created automatically by the setup. In case it's not, run:\nNew-NetFirewallRule -Name sshd -DisplayName 'OpenSSH Server (sshd)' -Enabled True -Direction Inbound -Protocol TCP -Action Allow -LocalPort 22\nCheck the installation: You can check that the installation was successful by running:\nGet-WindowsCapability -Online | ? Name -like 'OpenSSH*'\nCreate an SSH key pair: On your local machine, use ssh-keygen to create an SSH key pair. If you're on Linux or macOS, you can use the following command:\nssh-keygen\nSet permission\ncd ~\nmkdir .ssh\nnotepad.exe .ssh\\authorized_keys\nAdd content for authorized_keys file\nicacls .ssh /inheritance:r\nicacls .ssh /grant \"your-username:(F)\"\nicacls .ssh\\authorized_keys /inheritance:r\nicacls .ssh\\authorized_keys /grant \"your-username:(F)\"\nOpen config file at C:\\\\<your-username>\\ssh\\sshd_config and remove the # at the beginning of the line to uncomment it, and change 22 to your desired port number. For example, to change the SSH port to 2422\nPort 2422\nRestart SSH server to take effect\nRestart-Service sshd\nGet-Service sshd"}},"/docs/release-management":{"title":"Git Strategies & Release Management","data":{"overview#Overview":"The release cycle has 5 phases\nPhase 1: Start new release\nPhase 2: Develop\nPhase 3: Release\nPhase 4: Hotfix release (Optional)\nPhase 5: Close the release","branches#Branches":"","default-branch#Default branch":"All branches have suffix Test in name are default branches: RPGlobal-Test, RPServiceGate-Test, RPWebMVC-Test, AppTest\nTest branches have the latest commits including New features, Bugfixes and Hotfixes\nTest branches are the base branches of Developers on their daily work. It means that all commits MUST BE merged into Test branches first.","release-branch#Release branch":"Release branch is created at Phase 1: Start new release and based on Test branch.\nRelease branch's name has the following convention Release-<YYYYMMDD>. For example, the release name Release-20231121 indicating that all commits in this branch are releasing on 21 November, 2023\nAll commits are ready to push into Release branch must come from Test branch and pushed by using cherry-pick instead of merge","deploy-branches#Deploy branches":"Deploy branches will be used for CI/CD pipeline in the future\nThere're 2 deploy branches: deploy/erptest and deploy/production\ndeploy/erptest is to deploy on ErpTest environment\ndeploy/production is to deploy on Production environment\nall commits in both deploy/erptest and deploy/production are synced from Release branch by using git command git reset --hard Release-<YYYYMMDD>","snapshot-branches#Snapshot branches":"All the branches such as: RPGlobal, RPServiceGate, RPWebMVC and RPErpApp are Snapshot branches.\nSnapshot branches includes the current version of the previous release.\nSnapshot branches is used for backup if there's big impact on the current release which cannot rollback.\nHere is the diagram describings how the branches work.","release-cycle#Release Cycle":"This section is to show WHO do WHAT. There're 3 basic roles in this release cycle\nLead or Release Manager\nDeveloper\nTester","phase-1-start-new-release#Phase 1: Start new release":"THINGS TO DO\nDetermine the Scope and the Due Date of the release.\nPrepare the Release branch.\nCreate a new Release branch is based on Test branch with name convention Release-<YYYYMMDD> for all repositories: RPGlobal, RPServiceGate, RPWebMVC, and RPErpApp","phase-2-development#Phase 2: Development":"THINGS TO DO\nDevelop new features, provide bugfixes or hotfixes (if any).\nVerify the changes\nThe hotfixes can be deployed at Phase 3: Release or Phase 4: Hotfix Release. It depends on the impact of the bugs.\nThe list of open pull requests\nReview and Merge Pull Requests of team members into Test branch. Note that Use Squash and Merge to combine multiple commits into single commit, it helps for cherry-pick a lot\ncherry-pick merged commits into Release branch\ncherry-pick hotfix commits into Deploy branch from Release branch (If any)\nSync all commits from Release branch into deploy/erptest (if needed)\nCreate a new branch from Test branch\nWhen the features, bugfixes or hotfixes are DONE, create a Pull Request to Test branch for review\nNotify Lead for review.\nHow to create Pull RequestStep 1Step 2Step 3: If your pull request is for hotfix, add hotfix label. Otherwise, leave it blank.\nDeploy the Test branch on Cloud everyday\nVerify all the changes from Developers for the release.\nCreate bug ticket (If any)","phase-3-release#Phase 3: Release":"THINGS TO DO\nDeploy on ErpTest and Production\nEnsure all changes have been PASSED all tests.\nThis phase is to release (deploy) all changes from the Phase 2: Development\nReview all commits for the release.\nSync all commits from Release branch into deploy/erptest and deploy/production branch.\nCreate build and deploy on ErpTest and Production","phase-4-hotfix-release-optional#Phase 4: Hotfix Release (Optional)":"THINGS TO DO\nRe-deploy the hotfixes on ErpTest and Production\nThis phase does NOT depend on other phases and can be released whenever necessary.\nThis phase only happens if critical bugs found on Production needed to fix ASAP.\nThis phase only includes DEPLOYMENT not DEVELOPMENT works. All hotfixes have been already done at Phase 2: Development\nSync hotfix commits from Release branch into deploy/erptest and deploy/production branch.\nCreate build and re-deploy on ErpTest and Production","phase-5-close-the-release#Phase 5: Close the release":"The quality of the release is good and stable enough to move the next release.THINGS TO DO\nCreate a snapshot for the release.\nSync all Release branches with RPGlobal, RPServiceGate, RPWebMVC and RPErpApp branch"}},"/":{"title":"RP-ERP Knowledge Base","data":{"":"Welcome to the RP-ERP Knowledge Base, your one-stop destination for mastering both technical intricacies and business processes in the world of Enterprise Resource Planning. Dive into a curated collection of technical documentation for seamless integration, and explore strategic insights to elevate your understanding of RP-ERP's impact on operational efficiency. Whether you're a tech enthusiast or a business leader, find the expertise you need to excel in resource planning and enterprise excellence."}}}